In [2]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 35, 28],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Boston']
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   35        Chicago
4      Eva   28         Boston

In [7]:
sorted = df.sort_index()

In [8]:
print(sorted)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles
3    David   35        Chicago
4      Eva   28         Boston

In [23]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 35, 28]
}

# Set a custom index for the DataFrame
index_labels = ['row5', 'row2', 'row4', 'row1', 'row3']

df = pd.DataFrame(data, index=index_labels)

In [24]:
df

         Name  Age
row5    Alice   25
row2      Bob   30
row4  Charlie   22
row1    David   35
row3      Eva   28

In [25]:
sorted = df.sort_index()

In [26]:
print(sorted)

         Name  Age
row1    David   35
row2      Bob   30
row3      Eva   28
row4  Charlie   22
row5    Alice   25

In [27]:
sorted = df.sort_index(ascending=False)

In [28]:
print(sorted)

         Name  Age
row5    Alice   25
row4  Charlie   22
row3      Eva   28
row2      Bob   30
row1    David   35

In [31]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A'],
    'Value1': [10, 20, 30, 40, 50],
    'Value2': [5, 15, 25, 35, 45]
}

df = pd.DataFrame(data)
print(df)

  Category  Value1  Value2
0        A      10       5
1        B      20      15
2        A      30      25
3        B      40      35
4        A      50      45

In [56]:
mean_values = df.mean()
sum_values = df.sum(numeric_only=True)
print("Here is the mean of columns: \n",mean_values)
print("""---------------------------
------------------------------""")
print("Here is the Sum of columns:\n",sum_values)

Here is the mean of columns:
 Value1    30.0
Value2    25.0
dtype: float64
---------------------------
------------------------------
Here is the Sum of columns:
 Value1    150
Value2    125
dtype: int64

/tmp/ipykernel_504/3330133883.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mean_values = df.mean()